Revit 2027 API
Wood.TextureRealWorldOffsetX Property
 The property labeled "Offset X" from the "Wood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TextureRealWorldOffsetX { get; }
Public Shared ReadOnly Property TextureRealWorldOffsetX As String
	Get
public:
static property String^ TextureRealWorldOffsetX {
	String^ get ();
}
static member TextureRealWorldOffsetX : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDistance".
See Also
Reference
Wood Class
Autodesk.Revit.DB.Visual Namespace